# AllMullionsAreTooShort Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainGridFamilyFailures..::..AllMullionsAreTooShort Property
BuiltInFailures..::..CurtainGridFamilyFailures Class See Also
---
The mullion(s) you are trying to place is too short for his type, and was not placed on the grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AllMullionsAreTooShort { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AllMullionsAreTooShort As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AllMullionsAreTooShort {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace